In [1]:
import pandas

In [2]:
pandas.Series

pandas.core.series.Series

In [3]:
a = [1,2,3,4]

In [4]:
a[0] # access data by index

1

In [5]:
s = pandas.Series(a)

In [6]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
s[1], s[3]

(2, 4)

In [8]:
s[:2]

0    1
1    2
dtype: int64

In [9]:
s * 2

0    2
1    4
2    6
3    8
dtype: int64

In [11]:
s2 = pandas.Series([2,3,4,5])

In [12]:
s2

0    2
1    3
2    4
3    5
dtype: int64

In [13]:
s + s2

0    3
1    5
2    7
3    9
dtype: int64

In [14]:
s3 = pandas.Series([3,4,5,6], index=['a', 'b', 'c', 'd'])

In [15]:
s3

a    3
b    4
c    5
d    6
dtype: int64

In [16]:
s3['a']

3

In [17]:
s3.index

Index([u'a', u'b', u'c', u'd'], dtype='object')

In [18]:
s4 = pandas.Series(2, index=s3.index)

In [19]:
s4

a    2
b    2
c    2
d    2
dtype: int64

In [20]:
s3 * s4

a     6
b     8
c    10
d    12
dtype: int64

In [21]:
s5 = pandas.Series([4,5,6], index=['c', 'd', 'e'])

In [22]:
s3 + s5

a     NaN
b     NaN
c     9.0
d    11.0
e     NaN
dtype: float64

In [23]:
len(s3), len(s5)

(4, 3)

In [24]:
s6 = s3 + s5

In [25]:
s6

a     NaN
b     NaN
c     9.0
d    11.0
e     NaN
dtype: float64

In [26]:
len(s6) # number of values in the series

5

In [27]:
s6.count() # count a value, ignore missing values

2

In [28]:
s3.unique() # find unique values

array([3, 4, 5, 6])

In [29]:
s7 = pandas.Series([1,1,1,2,2,3,4,4,4,5,5,3,4,0])

In [30]:
s7

0     1
1     1
2     1
3     2
4     2
5     3
6     4
7     4
8     4
9     5
10    5
11    3
12    4
13    0
dtype: int64

In [32]:
s7.unique()

array([1, 2, 3, 4, 5, 0])

In [33]:
s7.value_counts()

4    4
1    3
5    2
3    2
2    2
0    1
dtype: int64

In [35]:
s7.head(n=3)

0    1
1    1
2    1
dtype: int64

In [36]:
s7.tail(n=3)

11    3
12    4
13    0
dtype: int64

In [40]:
s3[['a', 'c']]

a    3
c    5
dtype: int64

In [41]:
s8 = pandas.Series([34,45,67,], index=[11,12,13])

In [42]:
s8

11    34
12    45
13    67
dtype: int64

In [43]:
s8[11]

34

In [46]:
s8.loc[11] # numerical label

34

In [50]:
s3

a    3
b    4
c    5
d    6
dtype: int64

In [51]:
s3[2]

5

In [54]:
s.loc[3]

4

In [53]:
s3.loc['a']

3

In [56]:
s7 > 2

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13    False
dtype: bool

In [57]:
idx = s7 > 2

In [58]:
idx

0     False
1     False
2     False
3     False
4     False
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13    False
dtype: bool

In [59]:
s7[idx]

5     3
6     4
7     4
8     4
9     5
10    5
11    3
12    4
dtype: int64

In [63]:
s7[(s7 > 2) | (s7 == 0)]

5     3
6     4
7     4
8     4
9     5
10    5
11    3
12    4
13    0
dtype: int64

In [65]:
s3

a    3
b    4
c    5
d    6
dtype: int64

In [66]:
s9 = pandas.Series([5,6,7], index=['a', 'a', 'c'])

In [67]:
s9

a    5
a    6
c    7
dtype: int64

In [68]:
s3 + s9

a     8.0
a     9.0
b     NaN
c    12.0
d     NaN
dtype: float64

In [69]:
s10 = pandas.Series([2,3,4], index=['a', 'a', 'd'])

In [70]:
s9 + s10

a    7.0
a    8.0
a    8.0
a    9.0
c    NaN
d    NaN
dtype: float64

In [108]:
s11 = s9 + s10

In [80]:
s11

a    7.0
a    8.0
a    8.0
a    9.0
c    NaN
d    NaN
dtype: float64

In [81]:
s11.duplicated()

a    False
a    False
a     True
a    False
c    False
d     True
dtype: bool

In [82]:
s11[s11.duplicated()]

a    8.0
d    NaN
dtype: float64

In [83]:
s11.drop_duplicates()

a    7.0
a    8.0
a    9.0
c    NaN
dtype: float64

In [84]:
cln_s11 = s11.drop_duplicates()

In [85]:
cln_s11

a    7.0
a    8.0
a    9.0
c    NaN
dtype: float64

In [86]:
s11.dropna()

a    7.0
a    8.0
a    8.0
a    9.0
dtype: float64

In [87]:
s11.dropna().drop_duplicates()

a    7.0
a    8.0
a    9.0
dtype: float64

In [89]:
s11.values, s11.index

(array([  7.,   8.,   8.,   9.,  nan,  nan]),
 Index([u'a', u'a', u'a', u'a', u'c', u'd'], dtype='object'))

In [90]:
s12 = s11.dropna().drop_duplicates()

In [91]:
s12

a    7.0
a    8.0
a    9.0
dtype: float64

In [92]:
s12.index = ['a', 'b', 'c']

In [93]:
s12

a    7.0
b    8.0
c    9.0
dtype: float64

In [94]:
s11

a    7.0
a    8.0
a    8.0
a    9.0
c    NaN
d    NaN
dtype: float64

In [95]:
s11.mean()

8.0

In [96]:
s11.mean(skipna=False)

nan

In [97]:
s11.median()

8.0

In [98]:
s11.describe()

count    4.000000
mean     8.000000
std      0.816497
min      7.000000
25%      7.750000
50%      8.000000
75%      8.250000
max      9.000000
dtype: float64

In [99]:
s11_stats = s11.describe()

In [100]:
s11_stats

count    4.000000
mean     8.000000
std      0.816497
min      7.000000
25%      7.750000
50%      8.000000
75%      8.250000
max      9.000000
dtype: float64

In [103]:
s11_stats['mean'], s11_stats['min']

(8.0, 7.0)

In [106]:
s11_stats['total'] = s11.sum()

In [107]:
s11_stats

count     4.000000
mean      8.000000
std       0.816497
min       7.000000
25%       7.750000
50%       8.000000
75%       8.250000
max       9.000000
total    64.000000
dtype: float64

In [109]:
s11

a    7.0
a    8.0
a    8.0
a    9.0
c    NaN
d    NaN
dtype: float64

In [110]:
s11.fillna(0)

a    7.0
a    8.0
a    8.0
a    9.0
c    0.0
d    0.0
dtype: float64

In [113]:
s11.fillna(method='ffill')

a    7.0
a    8.0
a    8.0
a    9.0
c    9.0
d    9.0
dtype: float64

In [114]:
s11.fillna(method='backfill')

a    7.0
a    8.0
a    8.0
a    9.0
c    NaN
d    NaN
dtype: float64

In [118]:
s11

a    7.0
a    8.0
a    8.0
a    9.0
c    NaN
d    NaN
dtype: float64

In [120]:
s3, s4

(a    3
 b    4
 c    5
 d    6
 dtype: int64, a    2
 b    2
 c    2
 d    2
 dtype: int64)

In [121]:
pandas.concat([s3, s4])

a    3
b    4
c    5
d    6
a    2
b    2
c    2
d    2
dtype: int64

In [122]:
import pandas as pd

In [123]:
s13 = pd.Series(['normal', 'abnormal'])

In [124]:
s13

0      normal
1    abnormal
dtype: object

In [125]:
s13.index = ['a', 'b']

In [126]:
s13

a      normal
b    abnormal
dtype: object

In [128]:
s13.reindex(['a', 'b', 'c'])

a      normal
b    abnormal
c         NaN
dtype: object

In [130]:
s14 = pandas.concat([s3, s4])

In [135]:
s14.index = range(len(s14))

In [136]:
s14

0    3
1    4
2    5
3    6
4    2
5    2
6    2
7    2
dtype: int64

In [143]:
s11.size, s11.index

(6, Index([u'a', u'a', u'a', u'a', u'c', u'd'], dtype='object'))

## Data Frame

In [145]:
df = pd.DataFrame({'a': [1,2,3,4], 'b': [2,3,4,5]})

In [146]:
df

   a  b
0  1  2
1  2  3
2  3  4
3  4  5

In [147]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [148]:
df[['a', 'b']]

   a  b
0  1  2
1  2  3
2  3  4
3  4  5

In [149]:
df['c'] = [6,7,8,9] # add a colum from a list

In [150]:
df

   a  b  c
0  1  2  6
1  2  3  7
2  3  4  8
3  4  5  9

In [151]:
df.shape

(4, 3)

In [152]:
df['a'].index

RangeIndex(start=0, stop=4, step=1)

In [153]:
df['a'] > 3

0    False
1    False
2    False
3     True
Name: a, dtype: bool

In [154]:
df[df['a'] > 3]

   a  b  c
3  4  5  9

In [156]:
df[(df['a'] > 3) | (df['c'] > 6)]

   a  b  c
1  2  3  7
2  3  4  8
3  4  5  9

In [157]:
df[(df['a'] > 3) | (df['c'] > 6)]['b']

1    3
2    4
3    5
Name: b, dtype: int64

In [159]:
df[(df['a'] > 3) | (df['c'] > 6)][['c', 'b']]

   c  b
1  7  3
2  8  4
3  9  5

In [160]:
se = pd.Series([3,4,5], index=[2,3,4])

In [161]:
se

2    3
3    4
4    5
dtype: int64

In [162]:
df['e'] = se

In [163]:
df

   a  b  c    e
0  1  2  6  NaN
1  2  3  7  NaN
2  3  4  8  3.0
3  4  5  9  4.0

In [171]:
df.dropna()

   a  b  c    e
2  3  4  8  3.0
3  4  5  9  4.0

In [182]:
df.dropna(axis=1, thresh=3)

   a  b  c
0  1  2  6
1  2  3  7
2  3  4  8
3  4  5  9

In [186]:
df

   a  b  c    e
0  1  2  6  NaN
1  2  3  7  NaN
2  3  4  8  3.0
3  4  5  9  4.0

In [189]:
df2 = pd.DataFrame([[2,3,4], [2,3,4]])

In [190]:
df2

   0  1  2
0  2  3  4
1  2  3  4

In [191]:
df2.drop_duplicates()

   0  1  2
0  2  3  4

In [192]:
df2.drop_duplicates?

In [193]:
df3 = pd.DataFrame([[2,1,4], [2,3,4]])

In [194]:
df3

   0  1  2
0  2  1  4
1  2  3  4

In [195]:
df3.drop_duplicates(subset=[0,2])

   0  1  2
0  2  1  4

In [199]:
df.fillna(method='backfill')

   a  b  c    e
0  1  2  6  3.0
1  2  3  7  3.0
2  3  4  8  3.0
3  4  5  9  4.0

In [200]:
df.describe()

              a         b         c         e
count  4.000000  4.000000  4.000000  2.000000
mean   2.500000  3.500000  7.500000  3.500000
std    1.290994  1.290994  1.290994  0.707107
min    1.000000  2.000000  6.000000  3.000000
25%    1.750000  2.750000  6.750000  3.250000
50%    2.500000  3.500000  7.500000  3.500000
75%    3.250000  4.250000  8.250000  3.750000
max    4.000000  5.000000  9.000000  4.000000

### BMI project

Load data from the Internet

In [258]:
import urllib2
# data = pd.read_csv('sample1.csv') # local file
data = pd.read_csv(urllib2.urlopen('https://raw.githubusercontent.com/likit/training-2017-08-01-prince-songkhla/master/sample1.csv'))

In [259]:
data.head()

            id first_name  last_name  gender  weight  height
0  289-90-0980    Shirley     Baylay  Female   82.22  169.09
1  709-24-2905    Beltran     Olczyk    Male   91.43  172.48
2  408-48-6169     Gussie     Wenban  Female   74.12  168.62
3  576-36-5194   Fernando  Bettenson    Male   86.62  174.42
4  124-96-2199      Rikki   Bruckman  Female   55.01  185.57

In [203]:
data.describe()

           weight      height
count  984.000000  984.000000
mean    77.021657  170.823425
std     19.040813   11.235683
min     45.060000  150.030000
25%     60.777500  161.330000
50%     77.120000  171.680000
75%     92.755000  180.185000
max    109.970000  189.890000

In [204]:
data.shape

(1000, 6)

In [205]:
data.columns

Index([u'id', u'first_name', u'last_name', u'gender', u'weight', u'height'], dtype='object')

In [207]:
data[['first_name', 'last_name', 'gender']].head()

  first_name  last_name  gender
0    Shirley     Baylay  Female
1    Beltran     Olczyk    Male
2     Gussie     Wenban  Female
3   Fernando  Bettenson    Male
4      Rikki   Bruckman  Female

In [213]:
data['gender'].value_counts()

Male      521
Female    479
Name: gender, dtype: int64

In [214]:
data['gender'].value_counts() / len(data)*100.0

Male      52.1
Female    47.9
Name: gender, dtype: float64

In [218]:
data['last_name'].value_counts()

Fearnehough    2
Adriani        2
Gipp           2
Bold           2
Wheeliker      2
Spiers         2
Suggey         2
Hyndman        2
Pepall         1
Abdie          1
Otham          1
Bunhill        1
Grumell        1
Nelle          1
Ryde           1
Seamons        1
Vasler         1
Buxey          1
Wolfindale     1
Downham        1
Gude           1
Rathbone       1
Beevis         1
Hodgin         1
McAvin         1
Maskrey        1
Oertzen        1
Dresser        1
Hembry         1
Hinkensen      1
              ..
MacIlurick     1
Trevon         1
Burgin         1
Bravington     1
Dirand         1
Bodycombe      1
Ellis          1
Mallan         1
Romeuf         1
D'Aguanno      1
Hourigan       1
Boreland       1
Tanzer         1
Causey         1
Gandrich       1
Pohls          1
Cobbald        1
Larrett        1
Mazzia         1
Conklin        1
Atmore         1
Simionescu     1
Haldenby       1
McQuirter      1
Kiffin         1
Bartram        1
Sumpter        1
Byers          1
Baylay         1
Taks           1
Name: last_name, Length: 992, dtype: int64

In [228]:
len(data[data['weight'].isnull()])

16

In [227]:
data.dropna().count()

id            984
first_name    984
last_name     984
gender        984
weight        984
height        984
dtype: int64

Remove missing values.

In [260]:
cln_data = data.dropna()

In [261]:
cln_data.count()

id            984
first_name    984
last_name     984
gender        984
weight        984
height        984
dtype: int64

Save data to files.

In [231]:
cln_data.to_csv('cleaned_sample.csv')

In [232]:
data.to_csv('raw_sample.csv')

In [264]:
cln_data.loc[:,'height_meter'] = cln_data['height'] / 100.0

In [255]:
cln_data.loc[20:25, ['first_name', 'height_meter']]

   first_name  height_meter
20     Yvette        1.6827
21     Corina        1.8111
22      Emile        1.8213
23    Lombard        1.5518
24      Selig        1.7660
25    Skipton        1.7825

In [266]:
cln_data.loc[:, 'bmi'] = cln_data['weight'] / cln_data['height_meter']**2

In [250]:
cln_data[['first_name', 'last_name', 'bmi']].head()

  first_name  last_name        bmi
0    Shirley     Baylay  28.756871
1    Beltran     Olczyk  30.733444
2     Gussie     Wenban  26.068572
3   Fernando  Bettenson  28.472501
4      Rikki   Bruckman  15.974457

In [273]:
overweight_idx = cln_data[cln_data['bmi']>30.0].index

In [276]:
cln_data.loc[overweight_idx,['bmi']].head() # row indexer

          bmi
1   30.733444
5   41.732974
6   33.825572
22  32.482863
23  37.623284

In [279]:
cln_data.loc[overweight_idx,'class'] = 'overweight' # row indexer

In [284]:
cln_data['class'].fillna('normal', inplace=True)

/Users/likitpreeyanon/anaconda/envs/training/lib/python2.7/site-packages/pandas/core/generic.py:3660: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [289]:
cln_data['class'].value_counts()

normal        647
overweight    337
Name: class, dtype: int64

In [292]:
cln_data.head()

,id,first_name,last_name,gender,height,height_meter,bmi,class
0,289-90-0980,Shirley,Baylay,Female,169.09,1.6909,28.756871,normal
1,709-24-2905,Beltran,Olczyk,Male,172.48,1.7248,30.733444,overweight
2,408-48-6169,Gussie,Wenban,Female,168.62,1.6862,26.068572,normal
3,576-36-5194,Fernando,Bettenson,Male,174.42,1.7442,28.472501,normal
4,124-96-2199,Rikki,Bruckman,Female,185.57,1.8557,15.974457,normal

In [308]:
cln_data.rename(columns={'gender': 'sex','bmi': 'BMI'}, inplace=True)

In [301]:
cln_data.columns

Index([u'id', u'first_name', u'last_name', u'sex', u'height', u'height_meter',
       u'BMI', u'class'],
      dtype='object')

In [303]:
cleaned_data = data.dropna().copy()

              id     first_name      last_name  gender  weight  height
0    289-90-0980        Shirley         Baylay  Female   82.22  169.09
1    709-24-2905        Beltran         Olczyk    Male   91.43  172.48
2    408-48-6169         Gussie         Wenban  Female   74.12  168.62
3    576-36-5194       Fernando      Bettenson    Male   86.62  174.42
4    124-96-2199          Rikki       Bruckman  Female   55.01  185.57
5    534-15-9694           Phil         Malser  Female  100.16  154.92
6    662-30-5431        Lindsay      O'Donovan  Female  104.79  176.01
7    823-16-1039          Alwin        Studman    Male   62.59  171.02
8    499-20-2699         Dennie   Dellenbroker    Male   62.97  187.61
9    200-53-8859         Lilyan     Langcastle  Female   50.45  155.24
10   105-78-7538         Raynor          Byers    Male   72.24  155.26
11   708-03-7487        Isadora        Fosdick  Female   77.30  188.38
12   338-74-5379           Riki      MacMurray  Female   53.59  175.30
13   672-68-8153        Rancell       Sheivels    Male   60.99  173.90
14   807-93-3700         Ardith           Gipp  Female   58.79  180.26
15   139-28-0118       Kirsteni   Fraczkiewicz  Female   58.74  189.40
16   227-29-1308  Shellysheldon       Jankovic    Male   67.18  166.48
17   595-56-3950         Amanda     Vasishchev  Female   54.53  175.05
18   213-14-6717        Janenna        Mealand  Female   63.78  151.81
19   295-85-0351         Andres          Clows    Male   45.70  189.57
20   158-76-5981         Yvette       Gostling  Female   70.45  168.27
21   165-34-0505         Corina        Jaquiss  Female   69.00  181.11
22   438-18-7699          Emile       Ibbotson    Male  107.75  182.13
23   394-34-6395        Lombard        Provest    Male   90.60  155.18
24   260-86-4420          Selig        Wilcock    Male   83.72  176.60
25   896-46-4112        Skipton        Bullier    Male   81.73  178.25
26   158-75-4678           Asia       Trelease  Female  100.80  171.28
27   801-73-2389         Farica          Bradd  Female   94.54  181.08
28   659-65-5664        Jacklyn        Blockey  Female   61.47  179.70
29   186-37-6945        Timothy        Milmore    Male  109.63  178.79
..           ...            ...            ...     ...     ...     ...
970  573-71-7163          Berte        Pifford  Female   62.45  164.26
971  397-11-0944       Chandler          Maier    Male   47.81  167.80
972  704-48-6823        Whitney          Dykas  Female   98.03  171.09
973  165-82-2287          Birch      Demkowicz    Male   55.28  156.90
974  882-31-5352       Antonina           Tuck  Female   69.60  167.74
975  448-01-8134         Galvin        Crenage    Male   98.81  164.18
976  688-30-7379         Austin  Shufflebotham    Male   52.77  175.27
977  652-15-5420        Abagael        Koppens  Female   80.29  181.51
978  552-52-1069          Flynn     MacKissack    Male   91.41  162.06
979  774-35-1552         Talbot        Carlino    Male   82.83  170.26
980  390-74-3488       Shurlock          Giddy    Male   67.36  172.84
981  183-12-6354      Frederigo           Flag    Male  105.55  178.26
982  553-52-4624           Ebba        Ridgers  Female   82.87  161.54
983  319-71-3406       Nikaniki         Fossey  Female   71.81  180.04
984  608-02-3535          Brent     Eykelbosch    Male   98.34  178.81
985  428-28-6357         Karina         Burgin  Female   69.99  158.38
986  677-91-0390       Clemente       Mattusov    Male   97.77  187.44
987  498-41-6722       Melicent       Mainland  Female   73.56  163.53
988  620-84-2915          Issie         Guerin  Female   49.68  176.56
989  397-57-7478           Mort         Bansal    Male   87.43  150.61
990  695-67-5738          Laird           Ayer    Male   70.14  155.63
991  787-68-1559         Selena         Grewes  Female   86.83  159.67
992  163-82-0270       Katerina      Standeven  Female   91.35  163.18
993  109-65-5931            Guy        Yoakley    Male   84.63  169.19
994  306-47-1291       Natassia         Robers  Female   77.39  169.35
995  732-65-6326         Cobbie      Flitcroft    Male   85.62  159.55
996  869-19-5879           Link         Mallan    Male   95.30  150.90
997  760-29-3381      Inglebert          Chave    Male  106.35  181.82
998  208-53-9148       Leonhard        Drawmer    Male   95.39  169.98
999  423-03-7537      Mellisent      Valintine  Female  108.58  180.23

[1000 rows x 6 columns]

In [304]:
del data

In [307]:
cln_data

,id,first_name,last_name,sex,height,height_meter,BMI,class
0,289-90-0980,Shirley,Baylay,Female,169.09,1.6909,28.756871,normal
1,709-24-2905,Beltran,Olczyk,Male,172.48,1.7248,30.733444,overweight
2,408-48-6169,Gussie,Wenban,Female,168.62,1.6862,26.068572,normal
3,576-36-5194,Fernando,Bettenson,Male,174.42,1.7442,28.472501,normal
4,124-96-2199,Rikki,Bruckman,Female,185.57,1.8557,15.974457,normal
5,534-15-9694,Phil,Malser,Female,154.92,1.5492,41.732974,overweight
6,662-30-5431,Lindsay,O'Donovan,Female,176.01,1.7601,33.825572,overweight
7,823-16-1039,Alwin,Studman,Male,171.02,1.7102,21.399871,normal
8,499-20-2699,Dennie,Dellenbroker,Male,187.61,1.8761,17.890469,normal
9,200-53-8859,Lilyan,Langcastle,Female,155.24,1.5524,20.934081,normal
10,105-78-7538,Raynor,Byers,Male,155.26,1.5526,29.968056,normal
11,708-03-7487,Isadora,Fosdick,Female,188.38,1.8838,21.782610,normal
12,338-74-5379,Riki,MacMurray,Female,175.30,1.7530,17.438934,normal
13,672-68-8153,Rancell,Sheivels,Male,173.90,1.7390,20.167844,normal
14,807-93-3700,Ardith,Gipp,Female,180.26,1.8026,18.092756,normal
15,139-28-0118,Kirsteni,Fraczkiewicz,Female,189.40,1.8940,16.374724,normal
16,227-29-1308,Shellysheldon,Jankovic,Male,166.48,1.6648,24.239065,normal
17,595-56-3950,Amanda,Vasishchev,Female,175.05,1.7505,17.795544,normal
18,213-14-6717,Janenna,Mealand,Female,151.81,1.5181,27.674753,normal
19,295-85-0351,Andres,Clows,Male,189.57,1.8957,12.716775,normal
20,158-76-5981,Yvette,Gostling,Female,168.27,1.6827,24.880987,normal
21,165-34-0505,Corina,Jaquiss,Female,181.11,1.8111,21.036052,normal
22,438-18-7699,Emile,Ibbotson,Male,182.13,1.8213,32.482863,overweight
23,394-34-6395,Lombard,Provest,Male,155.18,1.5518,37.623284,overweight
24,260-86-4420,Selig,Wilcock,Male,176.60,1.7660,26.844037,normal
25,896-46-4112,Skipton,Bullier,Male,178.25,1.7825,25.723048,normal
26,158-75-4678,Asia,Trelease,Female,171.28,1.7128,34.359531,overweight
27,801-73-2389,Farica,Bradd,Female,181.08,1.8108,28.831991,normal
28,659-65-5664,Jacklyn,Blockey,Female,179.70,1.7970,19.035621,normal
29,186-37-6945,Timothy,Milmore,Male,178.79,1.7879,34.295960,overweight
...,...,...,...,...,...,...,...,...
970,573-71-7163,Berte,Pifford,Female,164.26,1.6426,23.145619,normal
971,397-11-0944,Chandler,Maier,Male,167.80,1.6780,16.979888,normal
972,704-48-6823,Whitney,Dykas,Female,171.09,1.7109,33.489584,overweight
973,165-82-2287,Birch,Demkowicz,Male,156.90,1.5690,22.455470,normal
974,882-31-5352,Antonina,Tuck,Female,167.74,1.6774,24.736370,normal
975,448-01-8134,Galvin,Crenage,Male,164.18,1.6418,36.657293,overweight
976,688-30-7379,Austin,Shufflebotham,Male,175.27,1.7527,17.177973,normal
977,652-15-5420,Abagael,Koppens,Female,181.51,1.8151,24.370270,normal
978,552-52-1069,Flynn,MacKissack,Male,162.06,1.6206,34.805032,overweight
979,774-35-1552,Talbot,Carlino,Male,170.26,1.7026,28.573432,normal
980,390-74-3488,Shurlock,Giddy,Male,172.84,1.7284,22.548287,normal
981,183-12-6354,Frederigo,Flag,Male,178.26,1.7826,33.216237,overweight
982,553-52-4624,Ebba,Ridgers,Female,161.54,1.6154,31.756833,overweight
983,319-71-3406,Nikaniki,Fossey,Female,180.04,1.8004,22.153733,normal
984,608-02-3535,Brent,Eykelbosch,Male,178.81,1.7881,30.757186,overweight
985,428-28-6357,Karina,Burgin,Female,158.38,1.5838,27.901999,normal
986,677-91-0390,Clemente,Mattusov,Male,187.44,1.8744,27.827940,normal
987,498-41-6722,Melicent,Mainland,Female,163.53,1.6353,27.507229,normal
988,620-84-2915,Issie,Guerin,Female,176.56,1.7656,15.936647,normal
989,397-57-7478,Mort,Bansal,Male,150.61,1.5061,38.543652,overweight
990,695-67-5738,Laird,Ayer,Male,155.63,1.5563,28.958704,normal
991,787-68-1559,Selena,Grewes,Female,159.67,1.5967,34.058314,overweight
992,163-82-0270,Katerina,Standeven,Female,163.18,1.6318,34.306364,overweight
993,109-65-5931,Guy,Yoakley,Male,169.19,1.6919,29.564801,normal
994,306-47-1291,Natassia,Robers,Female,169.35,1.6935,26.984504,normal
995,732-65-6326,Cobbie,Flitcroft,Male,159.55,1.5955,33.634239,overweight
996,869-19-5879,Link,Mallan,Male,150.90,1.5090,41.851827,overweight
997,760-29-3381,Inglebert,Chave,Male,181.82,1.8182,32.170232,overweight
998,208-53-9148,Leonhard,Drawmer,Male,169.98,1.6998,33.014688,overweight
999,423-03-7537,Mellisent,Valintine,Female,180.23,1.8023,33.426867,overweight

In [311]:
pd.crosstab(cln_data['sex'], cln_data['class'])

class   normal  overweight
sex
Female     323         149
Male       324         188

In [332]:
pd.crosstab(cln_data['sex'], cln_data['class'],
            margins=True)

class   normal  overweight  All
sex
Female     323         149  472
Male       324         188  512
All        647         337  984

In [325]:
pd.crosstab(cln_data['sex'], cln_data['class'],
            normalize='index')

class     normal  overweight
sex
Female  0.684322    0.315678
Male    0.632812    0.367188

In [330]:
cln_data.pivot_table?

In [331]:
cln_data.head()

,id,first_name,last_name,sex,height,height_meter,BMI,class
0,289-90-0980,Shirley,Baylay,Female,169.09,1.6909,28.756871,normal
1,709-24-2905,Beltran,Olczyk,Male,172.48,1.7248,30.733444,overweight
2,408-48-6169,Gussie,Wenban,Female,168.62,1.6862,26.068572,normal
3,576-36-5194,Fernando,Bettenson,Male,174.42,1.7442,28.472501,normal
4,124-96-2199,Rikki,Bruckman,Female,185.57,1.8557,15.974457,normal

In [340]:
data = pd.read_csv('raw_sample.csv', sep=',', index_col='id')

In [341]:
data.head()

             Unnamed: 0 first_name  last_name  gender  weight  height
id
289-90-0980           0    Shirley     Baylay  Female   82.22  169.09
709-24-2905           1    Beltran     Olczyk    Male   91.43  172.48
408-48-6169           2     Gussie     Wenban  Female   74.12  168.62
576-36-5194           3   Fernando  Bettenson    Male   86.62  174.42
124-96-2199           4      Rikki   Bruckman  Female   55.01  185.57